dist/common-lisp-resources.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gianluca's blog</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"
                  href="./style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Gianluca's blog</h1>
<p>
<a href="./index.html">Home</a>
</p>
<div id="outline-container-common-lisp-resources" class="outline-2">
<h2 id="common-lisp-resources">Common Lisp resources</h2>
<div class="outline-text-2" id="text-common-lisp-resources">
<p>
Some links that point to resources I want to remember about, and that
can be useful for others. This is part of my journey on learning Common
Lisp.
</p>

<ul class="org-ul">
<li><a href="https://gigamonkeys.com/book/">Practical Common Lisp</a>: a great
introduction on the main aspects of the language</li>
<li><a href="https://softouch.on.ca/kb/data/Common%20Lisp%20Recipes.pdf">Common
Lisp Recipes</a>: CL patterns, to be consulted on need</li>
<li><a href="https://paulgraham.com/onlisp.html">On Lisp</a>: advanced Lisp
techniques</li>
<li><a href="https://www.lispworks.com/documentation/HyperSpec/Front/StartPts.htm">Common
Lisp HyperSpec</a></li>
<li><a href="https://github.com/norvig/paip-lisp/tree/main">Paradigms of
Artificial Intelligence Programming: Case Studies in Common Lisp</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
